Revit 2025 API
LoadCombinationState Enumeration
 Specifies load combination state.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LoadCombinationState
Public Enumeration LoadCombinationState
public enum class LoadCombinationState
type LoadCombinationState
Members
Member name | Value | Description
Serviceability | 0 |  Serviceability
Ultimate | 1 |  Ultimate
See Also
Reference
Autodesk.Revit.DB.Structure Namespace